# InfrastructureAlignmentDisplayedEndStation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..InfrastructureAlignmentDisplayedEndStation Property
ParameterTypeId Class See Also
---
"Displayed End Station"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId InfrastructureAlignmentDisplayedEndStation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InfrastructureAlignmentDisplayedEndStation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InfrastructureAlignmentDisplayedEndStation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace